app/Controllers/user/Aktivitasctrl.php

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_aktivitas`
---
    public function index()
    {
        $lang = session()->get('lang') ?? 'id';

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->findAll(),
            'lang' => $lang
        ];

SELECT *
FROM `tb_aktivitas`
WHERE `slug_id` = 'clove-export'
OR `slug_en` = 'clove-export'
 LIMIT 1
SELECT *
FROM `tb_profil`
---
    public function detail($slug)
    {
        helper('text');

        // Ambil bahasa dari session atau gunakan 'id' sebagai default
        $lang = session()->get('lang') ?? 'id';

        // Cari aktivitas berdasarkan slug_id atau slug_en
        $kegiatan = $this->AktivitasModel
            ->where('slug_id', $slug)
            ->orWhere('slug_en', $slug)
            ->first();

        // Tentukan prefix berdasarkan bahasa (artikel untuk 'id' dan article untuk 'en')
        $url_prefix = $lang === 'id' ? 'kegiatan' : 'activities';

        // Memilih slug berdasarkan prefix URL
        $correct_slug_id = $kegiatan->slug_id;
        $correct_slug_en = $kegiatan->slug_en;

        // Jika slug tidak sesuai dengan slug dalam bahasa saat ini, redirect ke slug yang benar
        if ($lang === 'id' && $slug !== $correct_slug_id) {
            return redirect()->to(base_url("{$lang}/{$url_prefix}/{$correct_slug_id}"));
        } elseif ($lang === 'en' && $slug !== $correct_slug_en) {
            return redirect()->to(base_url("{$lang}/{$url_prefix}/{$correct_slug_en}"));
        }

        // Ambil data profil perusahaan
        $data['profil'] = $this->ProfilModel->findAll();

SELECT *
FROM `tb_aktivitas`
WHERE `slug_id` = 'ekspor-cengkeh'
 LIMIT 1
---
        // Tentukan field slug berdasarkan bahasa yang aktif
        if ($lang === 'id') {
            // Cari aktivitas berdasarkan slug Indonesia
            $data['tbaktivitas'] = $this->AktivitasModel->where('slug_id', $slug)->first();

SELECT *
FROM `tb_aktivitas`
WHERE `slug_en` = 'clove-export'
 LIMIT 1
---
            $data['Title'] = $data['tbaktivitas']->nama_aktivitas_in ?? '';
        } else {
            // Cari aktivitas berdasarkan slug English
            $data['tbaktivitas'] = $this->AktivitasModel->where('slug_en', $slug)->first();