app/Controllers/user/Productsctrl.php

SELECT *
FROM `tb_produk`
WHERE `slug_id` = 'cumin'
OR `slug_en` = 'cumin'
 LIMIT 1
SELECT *
FROM `tb_profil`
---
    public function detail($slug)
    {
        $lang = session()->get('lang') ?? 'id';  // Set default language to Indonesian if no session is found.

        // Cari produk berdasarkan slug
        $produk = $this->ProdukModel->where('slug_id', $slug)
            ->orWhere('slug_en', $slug)
            ->first();

        // Jika produk tidak ditemukan, tampilkan halaman 404
        if (!$produk) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Produk dengan slug $slug tidak ditemukan");
        }

        // Tentukan prefix berdasarkan bahasa (artikel untuk 'id' dan article untuk 'en')
        $url_prefix = $lang === 'id' ? 'produk' : 'product';

        // Memilih slug berdasarkan prefix URL
        $correct_slug_id = $produk->slug_id;
        $correct_slug_en = $produk->slug_en;

        // Jika slug tidak sesuai dengan slug dalam bahasa saat ini, redirect ke slug yang benar
        if ($lang === 'id' && $slug !== $correct_slug_id) {
            return redirect()->to(base_url("{$lang}/{$url_prefix}/{$correct_slug_id}"));
        } elseif ($lang === 'en' && $slug !== $correct_slug_en) {
            return redirect()->to(base_url("{$lang}/{$url_prefix}/{$correct_slug_en}"));
        }

        // Ambil produk berdasarkan slug
        $data['profil'] = $this->ProfilModel->findAll();

SELECT *
FROM `tb_produk`
WHERE `slug_id` = 'jintan-putih'
 LIMIT 1
SELECT *
FROM `tb_produk`
WHERE `slug_en` = 'cumin'
 LIMIT 1
---

        // Ambil produk berdasarkan slug yang sesuai
        if ($lang === 'id') {
            $data['tbproduk'] = $this->ProdukModel->where('slug_id', $slug)->first();
        } else {
            $data['tbproduk'] = $this->ProdukModel->where('slug_en', $slug)->first();