app/Models/MetaModel.php

    public function getMetaByPageName($nama_halaman)
    {
        return $this->where('nama_halaman', $nama_halaman)->first();
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Aktivitas'
 LIMIT 1